from masked_text_filler import print_filled_masked_text

texts_original = [
    "Κοινό πράγμα. - Αν η κυριότητα του πράγματος ανήκει σε περισσοτέρους εξ αδιαιρέτου κατ' ιδανικά μέρη, εφαρμόζονται οι διατάξεις για την κοινωνία.",
    "Πραγματική δουλεία σε βάρος ή υπέρ του κοινού ακινήτου - Στο κοινό ακίνητο μπορεί να συσταθεί πραγματική δουλεία υπέρ του εκάστοτε κυρίου άλλου ακινήτου και αν ακόμη αυτός είναι συγκύριος του ακινήτου που βαρύνεται με τη δουλεία. Το ίδιο ισχύει και για πραγματική δουλεία πάνω σε ακίνητο υπέρ των εκάστοτε κυρίων κοινού ακινήτου, αν κάποιος από αυτούς είναι κύριος του ακινήτου που βαρύνεται με τη δουλεία."
]

texts_masked = [
    "Κοινό πράγμα. - Αν η κυριότητα του [MASK] ανήκει σε περισσότερους [MASK] αδιαιρέτου κατ΄ιδανικά [MASK], εφαρμόζονται οι διατάξεις για την κοινωνία.",
    "Πραγματική δουλεία σε [MASK] η υπέρ του κοινού ακινήτου. - Στο κοινό [MASK] μπορεί να συσταθεί πραγματική δουλεία υπέρ του [MASK] κύριου άλλου ακινήτου και αν ακόμη αυτός είναι [MASK] του ακινήτου που βαρύνεται με τη δουλεία. Το ίδιο ισχύει και για την [MASK] δουλεία πάνω σε ακίνητο υπέρ των εκάστοτε κυρίων κοινού ακινήτου, αν [MASK] από αυτούς είναι κύριος του [MASK] που βαρύνεται με τη δουλεία."
]

print(f"Original Text 1:\n{texts_original[0]}\n")
print(f"Masked Text 1:\n{texts_masked[0]}\n")
print_filled_masked_text(texts_masked[0],"nlpaueb/bert-base-greek-uncased-v1","[MASK]")

print(f"Original Text 2:\n{texts_original[1]}\n")
print(f"Masked Text 2:\n{texts_masked[1]}\n")
print_filled_masked_text(texts_masked[1],"nlpaueb/bert-base-greek-uncased-v1","[MASK]")