from masked_text_filler import print_filled_masked_text

texts = [
    "Κοινό πράγμα. - Αν η κυριότητα του <mask> ανήκει σε περισσότερους <mask> αδιαιρέτου κατ΄ιδανικά <mask>, εφαρμόζονται οι διατάξεις για την κοινωνία.",
    "Πραγματική δουλεία σε <mask> η υπέρ του κοινού ακινήτου. — Στο κοινό <mask> μπορεί να συσταθεί πραγματική δουλεία υπέρ του <mask> κύριου άλλου ακινήτου και αν ακόμη αυτός είναι <mask> του ακινήτου που βαρύνεται με τη δουλεία. Το ίδιο ισχύει και για την <mask> δουλεία πάνω σε ακίνητο υπέρ των εκάστοτε κυρίων κοινού ακινήτου, αν <mask> από αυτούς είναι κύριος του <mask> που βαρύνεται με τη δουλεία."
]

print_filled_masked_text(texts[0],"xlm-roberta-base","<mask>")
print_filled_masked_text(texts[1],"xlm-roberta-base","<mask>")